AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_ПериодыОплатыКУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПериодыОплатыКУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПериодОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДокОплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>нпп</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыПоИсполнительномуПроизводству.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыПоИсполнительномуПроизводству</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаГоспошлины</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПредставительскихРасходов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ГруппаОплатыКУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФИОДолжника</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИсполнительныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ИсполнительныйЛист</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_ВидНачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидНачисленияПоУслугамЖКХ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПоИсполнительнымЛистам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПоИсполнительнымЛистам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВОСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноНаправленВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторноНаправленВОСП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВИнуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченВСвязиСНевозможностьюВзыскания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненВПолномОбъеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтменаСудом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВИФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Банкрот</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленНаОписку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченПоАктуСписанияУК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоПриостановлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаправленВДепартаментФинансов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/бит_НачисленияЖКХ/Ext/Module.bsl
#Область ФормированиеДвижений

Процедура СформироватьДвиженияОплатаНачисленияПоУслугамЖКХ(Организация, ТаблицаУслуг, ТаблицаУслугПоПериоду, Реквизиты, Движения, Отказ) Экспорт
	
	НачислениеПоУсл 					= Движения.бит_НачисленияПоУслугамЖКХ;
	НачислениеПени  					= Движения.бит_НачислениеПениПоУслугамЖКХ;
	НачислениеПоУслПоПериоду 			= Движения.бит_НачисленияПоУслугамЖКХПоПериоду;   
	НачислениеПоУсл.Записывать 			= Истина;
	НачислениеПени.Записывать  			= Истина;
	НачислениеПоУслПоПериоду.Записывать = Истина; 
	
	Для каждого СтрокаТЧ Из ТаблицаУслуг Цикл
		Если СтрокаТЧ.Сумма<>0 тогда
			Движение = НачислениеПоУсл.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период      = Реквизиты.Дата;
			Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
			Движение.Сумма       = СтрокаТЧ.Сумма;
			Движение.Организация  = Организация;
		КонецЕсли;
		Если СтрокаТЧ.СуммаПени <> 0 Тогда
			ДвижениеПени = НачислениеПени.Добавить();
			ДвижениеПени.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеПени.Период      = Реквизиты.Дата;
			ДвижениеПени.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
			ДвижениеПени.УслугаЖКХ   = СтрокаТЧ.Услуга;
			ДвижениеПени.СуммаПени   = СтрокаТЧ.СуммаПени;
			ДвижениеПени.Организация   = Организация;
		КонецЕсли;
	КонецЦикла;
	
	//+! Гаспирович В.В. ФормируемДвиженияПоПериоду 
	Если Реквизиты.ссылка.лб_ВидОплаты = справочники.лб_ВидыОплат.найтиПоКоду("000000004")
		и Реквизиты.ссылка.СписокУслугПоПериоду.количество() <>0 тогда 
		//Если это бухсправка, то таблица распределения по периодам уже расчтана   
		для каждого СтрокаТаб из Реквизиты.ссылка.СписокУслугПоПериоду цикл  
			СтрокаПоПериоду = НачислениеПоУслПоПериоду.добавитьРасход();   
			ЗаполнитьЗначенияСвойств(СтрокаПоПериоду,СтрокаТаб);  
			СтрокаПоПериоду.период = Реквизиты.дата;
			СтрокаПоПериоду.регистратор = Реквизиты.Ссылка; 
			СтрокаПоПериоду.Организация = реквизиты.Организация; 
			СтрокаПоПериоду.УслугаЖКХ = СтрокаТаб.услуга;
		КонецЦикла;
	иначе
		
		
		
		
		
		//1. Без исполнительных листов	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ОплатаКУСписокЛС.ЛицевойСчет КАК ЛицевойСчет,
			|	бит_ОплатаКУСписокЛС.Ссылка.Организация КАК Организация,
			|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист КАК ИсполнительныйЛист,
			|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК Сумма,
			|	бит_ОплатаКУСписокУслуг.Услуга КАК УслугаЖКХ,
			|	бит_ОплатаКУСписокЛС.лб_ПериодНачисления КАК лб_ПериодНачисления,
			|	бит_ОплатаКУСписокЛС.Ссылка.Дата КАК Период
			|ИЗ
			|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
			|		ПО бит_ОплатаКУСписокЛС.ЛицевойСчет = бит_ОплатаКУСписокУслуг.ЛицевойСчет
			|			И бит_ОплатаКУСписокЛС.лб_КлючСтроки = бит_ОплатаКУСписокУслуг.лб_КлючСтроки
			|ГДЕ
			|	бит_ОплатаКУСписокЛС.Ссылка = &Ссылка
			|	И бит_ОплатаКУСписокЛС.ИсполнительныйЛист = ЗНАЧЕНИЕ(Документ.бит_ИсполнительныйЛист.ПустаяСсылка)
			|	И бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_ОплатаКУСписокЛС.ЛицевойСчет,
			|	бит_ОплатаКУСписокУслуг.Услуга,
			|	бит_ОплатаКУСписокЛС.лб_ПериодНачисления,
			|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист,
			|	бит_ОплатаКУСписокЛС.Ссылка.Организация,
			|	бит_ОплатаКУСписокЛС.Ссылка.Дата";
		
		запрос.УстановитьПараметр("Ссылка",Реквизиты.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
			Если ВыборкаДетальныеЗаписи.Сумма <>0 тогда
				ДвижениеУслПоПериоду	 = НачислениеПоУслПоПериоду.Добавитьрасход();  
				ЗаполнитьЗначенияСвойств(ДвижениеУслПоПериоду,ВыборкаДетальныеЗаписи); 
				ДвижениеУслПоПериоду.ПериодВзаиморасчетов = ПолучитьПериодПоСтроке(реквизиты.ссылка,ВыборкаДетальныеЗаписи.лб_ПериодНачисления); 
			КонецЕсли;
		КонецЦикла;
		
		//2. ИсполнительныеЛистыСразуРаспределяемПоПериодам
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_ОплатаКУСписокЛС.ЛицевойСчет КАК ЛицевойСчет,
			|	бит_ОплатаКУСписокЛС.Ссылка.Организация КАК Организация,
			|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) КАК СуммаКРаспределению,
			|	бит_ОплатаКУСписокУслуг.Услуга КАК УслугаЖКХ,
			|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист.ПериодОбразованияЗадолженностиОт КАК ИсполнительныйЛистПериодОбразованияЗадолженностиОт,
			|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист КАК ИсполнительныйЛист
			|ПОМЕСТИТЬ вт01
			|ИЗ
			|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
			|		ПО бит_ОплатаКУСписокЛС.ЛицевойСчет = бит_ОплатаКУСписокУслуг.ЛицевойСчет
			|			И бит_ОплатаКУСписокЛС.лб_КлючСтроки = бит_ОплатаКУСписокУслуг.лб_КлючСтроки
			|ГДЕ
			|	бит_ОплатаКУСписокЛС.Ссылка = &Ссылка
			|	И бит_ОплатаКУСписокЛС.ИсполнительныйЛист <> ЗНАЧЕНИЕ(Документ.бит_ИсполнительныйЛист.ПустаяСсылка)
			|	И бит_ОплатаКУСписокУслуг.Ссылка = &Ссылка
			|	И бит_ОплатаКУСписокУслуг.Сумма <> 0
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_ОплатаКУСписокЛС.ЛицевойСчет,
			|	бит_ОплатаКУСписокУслуг.Услуга,
			|	бит_ОплатаКУСписокЛС.Ссылка.Организация,
			|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист.ПериодОбразованияЗадолженностиОт,
			|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист
			|
			|ИМЕЮЩИЕ
			|	СУММА(бит_ОплатаКУСписокУслуг.Сумма) <> 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.Организация КАК Организация,
			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
			|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов, МЕСЯЦ) КАК ПериодВзаиморасчетов,
			|	СУММА(бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток) КАК СуммаОстаток
			|ПОМЕСТИТЬ вт02
			|ИЗ
			|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(
			|			&ДатаДок,
			|			(Организация, ЛицевойСчет, УслугаЖКХ) В
			|				(ВЫБРАТЬ
			|					вт01.Организация КАК Организация,
			|					вт01.ЛицевойСчет КАК ЛицевойСчет,
			|					вт01.УслугаЖКХ КАК УслугаЖКХ
			|				ИЗ
			|					вт01 КАК вт01)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
			|ГДЕ
			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток > 0
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.Организация,
			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет,
			|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ,
			|	КОНЕЦПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов, МЕСЯЦ)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	вт01.ИсполнительныйЛист КАК ИсполнительныйЛист,
			|	вт01.ЛицевойСчет КАК ЛицевойСчет,
			|	вт01.УслугаЖКХ КАК УслугаЖКХ,
			|	вт01.Организация КАК Организация,
			|	МАКСИМУМ(ЕСТЬNULL(вт01.СуммаКРаспределению, 0)) КАК СуммаКРаспределению,
			|	вт02.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
			|	СУММА(ЕСТЬNULL(вт02.СуммаОстаток, 0)) КАК СуммаОстаток
			|ИЗ
			|	вт01 КАК вт01
			|		ЛЕВОЕ СОЕДИНЕНИЕ вт02 КАК вт02
			|		ПО вт01.Организация = вт02.Организация
			|			И вт01.ЛицевойСчет = вт02.ЛицевойСчет
			|			И вт01.УслугаЖКХ = вт02.УслугаЖКХ
			|			И вт01.ИсполнительныйЛистПериодОбразованияЗадолженностиОт <= вт02.ПериодВзаиморасчетов
			|
			|СГРУППИРОВАТЬ ПО
			|	вт01.Организация,
			|	вт01.ЛицевойСчет,
			|	вт01.УслугаЖКХ,
			|	вт02.ПериодВзаиморасчетов,
			|	вт01.ИсполнительныйЛист
			|
			|УПОРЯДОЧИТЬ ПО
			|	Организация,
			|	ЛицевойСчет,
			|	УслугаЖКХ,
			|	ИсполнительныйЛист,
			|	ПериодВзаиморасчетов
			|ИТОГИ
			|	МАКСИМУМ(СуммаКРаспределению),
			|	СУММА(СуммаОстаток)
			|ПО
			|	ИсполнительныйЛист,
			|	ЛицевойСчет,
			|	УслугаЖКХ";
		
		Запрос.УстановитьПараметр("ДатаДок", Реквизиты.Дата);
		Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаИсполнительныйЛист = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаИсполнительныйЛист.Следующий() Цикл
		
			ВыборкаЛицевойСчет = ВыборкаИсполнительныйЛист.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
			Пока ВыборкаЛицевойСчет.Следующий() Цикл
		
				ВыборкаУслугаЖКХ = ВыборкаЛицевойСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
				Пока ВыборкаУслугаЖКХ.Следующий() Цикл
		            СуммаКРаспределениюПоУслуге = ВыборкаУслугаЖКХ.СуммаКРаспределению;
					Если СуммаКРаспределениюПоУслуге>0 тогда
					
						ВыборкаДетальныеЗаписи = ВыборкаУслугаЖКХ.Выбрать();
		
						Пока ВыборкаДетальныеЗаписи.Следующий() и СуммаКРаспределениюПоУслуге>0 Цикл   
								Если ВыборкаДетальныеЗаписи.СуммаОстаток>0 тогда //это условие есть в запросе. продублирую тут
								    СуммаНаПериод = мин(ВыборкаДетальныеЗаписи.СуммаОстаток,СуммаКРаспределениюПоУслуге);
									ДвижениеУслПоПериоду	 = НачислениеПоУслПоПериоду.ДобавитьРасход();  
									ЗаполнитьЗначенияСвойств(ДвижениеУслПоПериоду,ВыборкаДетальныеЗаписи);
									ДвижениеУслПоПериоду.период = Реквизиты.дата;
									ДвижениеУслПоПериоду.Регистратор = Реквизиты.ссылка;
									ДвижениеУслПоПериоду.Сумма = СуммаНаПериод;
									СуммаКРаспределениюПоУслуге=СуммаКРаспределениюПоУслуге-СуммаНаПериод;
								КонецЕсли;  
		 				КонецЦикла; 
						Если СуммаКРаспределениюПоУслуге>0 тогда //если что-то осталось нераспределенное, то пишем остаток на текущий месяц
							ДвижениеУслПоПериоду	 = НачислениеПоУслПоПериоду.ДобавитьРасход();  
							ЗаполнитьЗначенияСвойств(ДвижениеУслПоПериоду,ВыборкаУслугаЖКХ);
							ДвижениеУслПоПериоду.Период = Реквизиты.дата;
							ДвижениеУслПоПериоду.Регистратор = Реквизиты.ссылка;
							ДвижениеУслПоПериоду.Сумма = СуммаКРаспределениюПоУслуге;  
							ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(реквизиты.дата);
							СуммаКРаспределениюПоУслуге=0;
							ДвижениеУслПоПериоду.Организация = Организация;
						КонецЕсли;
					иначе // к распределению меньше нуля, значит пишем в текущий период (распределение авансов потом закроет переплаты)
					    ДвижениеУслПоПериоду	 = НачислениеПоУслПоПериоду.ДобавитьРасход();  
						ЗаполнитьЗначенияСвойств(ДвижениеУслПоПериоду,ВыборкаУслугаЖКХ);
						ДвижениеУслПоПериоду.Период = Реквизиты.дата;
						ДвижениеУслПоПериоду.Регистратор = Реквизиты.ссылка;
						ДвижениеУслПоПериоду.Сумма = СуммаКРаспределениюПоУслуге; 
						ДвижениеУслПоПериоду.ПериодВзаиморасчетов = КонецМесяца(реквизиты.дата);
						ДвижениеУслПоПериоду.Организация = Организация;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЦикла;
		
		//Запишем периоды оплаты
		ДвиженияПериоды = Движения.бит_ПериодыОплатыКУ;
		нпп =1;
		Для каждого СтрокаТЧ Из реквизиты.ссылка.списокЛС Цикл
			ДвижениеПериода					  = ДвиженияПериоды.Добавить();
			ДвижениеПериода.ДокОплаты		  = Реквизиты.ссылка;
			ДвижениеПериода.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
			ДвижениеПериода.ПериодОплаты=НачалоМесяца(ПолучитьПериодПоСтроке(реквизиты.ссылка,СтрокаТЧ.лб_ПериодНачисления));
			ДвижениеПериода.нпп = нпп;
			нпп = нпп + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры  

Функция ПолучитьОстаткиУслугиПоПериодам(пВыборка) 
	//СтрокаНабора = пнабор.добавитьрасход();
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ВидНачисления КАК ВидНачисления,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток КАК СуммаОстаток,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.Организация КАК Организация,
		|	&МоментВремени КАК Период
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(
		|			&МоментВремени,
		|			УслугаЖКХ = &УслугаЖКХ
		|				И ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
		|ГДЕ
		|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ВидНачисления <> &ВидНачисленияАванс
		|	И бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток > 0
		|	И НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов, МЕСЯЦ) >= НАЧАЛОПЕРИОДА(&ДатаОт, МЕСЯЦ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПериодВзаиморасчетов";
	
	Запрос.УстановитьПараметр("ВидНачисленияАванс", Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс);
	Запрос.УстановитьПараметр("ДатаОт", пВыборка.ИсполнительныйЛистПериодОбразованияЗадолженностиОт);
	Запрос.УстановитьПараметр("ЛицевойСчет", пВыборка.ЛицевойСчет);
	Запрос.УстановитьПараметр("МоментВремени", КонецДня(пВыборка.Ссылка.дата));
	Запрос.УстановитьПараметр("УслугаЖКХ", пВыборка.УслугаЖКХ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	возврат РезультатЗапроса;   
КонецФункции

функция МинимальныйПериодОплаты() экспорт
	
	возврат(дата("20240930"));

КонецФункции

функция МаксимальныйПериодОплаты() экспорт
	
	возврат(дата("20351231"));

КонецФункции

Функция ПолучитьПериодПоСтроке(ДокСсылка,лб_ПериодНачисления) экспорт
	Отв = ДокСсылка.Дата; 
	ДО = "0000"+ лб_ПериодНачисления;
	ДО=СтрЗаменить(ДО," ","");
	ДО=СтрЗаменить(ДО,символы.нпп,"");    
	попытка
		Если СтрДлина(ДО)>7 тогда
			Если лев(прав(ДО,4),2) = "20" тогда
				ГодЧислом = число(прав(ДО,4));
				МесяцЧислом = число(лев(прав(ДО,6),2));
			иначе                       
				ГодЧислом = число("20"+прав(ДО,2));
				МесяцЧислом = число(лев(прав(ДО,4),2));
			КонецЕсли;
			Если МесяцЧислом>=1 и МесяцЧислом<=12 тогда
				Отв = Дата(ГодЧислом,МесяцЧислом,1);
			КонецЕсли;
		КонецЕсли;
	исключение  
		сообщить(СтрШаблон("В документе %1 некорректный период оплаты %2",ДокСсылка,лб_ПериодНачисления))
	конецпопытки;
	
	Если Отв<=МинимальныйПериодОплаты() тогда
		Возврат НачалоДня(КонецМесяца(МинимальныйПериодОплаты()));
	ИначеЕсли Отв>=МаксимальныйПериодОплаты() тогда   
		Возврат НачалоДня(КонецМесяца(ДокСсылка.Дата));
	иначе
		Возврат НачалоДня(КонецМесяца(Отв));
	КонецЕсли;
	
Конецфункции

Процедура СформироватьДвиженияОплатаХозрасчетный(ТаблицаУслуг, ТаблицаЛицевыхСчетов, Реквизиты, Движения, Отказ) Экспорт
	
	СчетУчетаЖКХ = ПланыСчетов.Хозрасчетный.НайтиПоКоду("76.КУ");
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("СчетАбонента", Неопределено);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Реквизиты.Дата, Реквизиты.Организация, СтруктураНастроек);
	
	Если СтруктураНастроек.СчетАбонента = СчетУчетаЖКХ Тогда
		
		Отбор = Новый Структура;
		
		Для каждого СтрокаТЧ Из ТаблицаЛицевыхСчетов Цикл
			
			Если ЗначениеЗаполнено(СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда 
				
				Отбор.Очистить();
				
				Отбор.Вставить("ЛицевойСчет"    , СтрокаТЧ.ЛицевойСчет);
				Отбор.Вставить("ШаблонИзвещений", СтрокаТЧ.ШаблонИзвещений);
				
				ПоискСтрок = ТаблицаУслуг.НайтиСтроки(Отбор);
				
				Для каждого СтрокаУслуг Из ПоискСтрок Цикл
					
					Проводка = Движения.Хозрасчетный.Добавить();
					мСумма = СтрокаУслуг.Сумма + СтрокаУслуг.СуммаПени;
					Проводка.Период     = Реквизиты.Дата;
					Проводка.Содержание = "Оплата КУ";
					Проводка.Организация = Реквизиты.Организация;
					
					Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаУслуг.Услуга);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
					Проводка.СчетДт = СтрокаТЧ.СчетКУ;
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
					БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);
					Проводка.Сумма = мСумма;
					
				КонецЦикла; 
				
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Для каждого СтрокаТЧ Из ТаблицаЛицевыхСчетов Цикл
			
			Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда 
				
				Проводка = Движения.Хозрасчетный.Добавить();
				мСумма = СтрокаТЧ.Сумма;
				Проводка.Период     = Реквизиты.Дата;
				Проводка.Содержание = "Оплата КУ";
				Проводка.Организация = Реквизиты.Организация;
				
				Проводка.СчетКт = СтрокаТЧ.СчетАбонента;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 1, СтрокаТЧ.Субконто1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 2, СтрокаТЧ.Субконто2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетКт, Проводка.СубконтоКт, 3, СтрокаТЧ.Субконто3);
				Проводка.СчетДт = СтрокаТЧ.СчетКУ;
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 1, СтрокаТЧ.СубконтоКУ1);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 2, СтрокаТЧ.СубконтоКУ2);
				БухгалтерскийУчет.УстановитьСубконто(Проводка.СчетДт, Проводка.СубконтоДт, 3, СтрокаТЧ.СубконтоКУ3);	
				Проводка.Сумма = мСумма;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

Процедура СформироватьДвиженияВводНачальныхОстатковПоКУНачисленияПоУслугамЖКХ(Организация, ТаблицаУслуг, Движения, Отказ) Экспорт
	
	НачислениеПоУсл = Движения.бит_НачисленияПоУслугамЖКХ;
	
	//// БИТ_ЖКХ 15.03.2016 11:22:47 Начало правки... 
	//НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;
	//// БИТ_ЖКХ 15.03.2016 11:22:49 Конец правки. 

	Для каждого СтрокаТЧ Из ТаблицаУслуг Цикл
		
		Движение = НачислениеПоУсл.Добавить();
		
		Если СтрокаТЧ.Сумма < 0 тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			мСумма = - СтрокаТЧ.Сумма;
		иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			мСумма =  СтрокаТЧ.Сумма;
		КонецЕсли;
		
		Движение.Период      = СтрокаТЧ.Период;
		Движение.ЛицевойСчет = СтрокаТЧ.ЛицевойСчет;
		Движение.УслугаЖКХ   = СтрокаТЧ.Услуга;
		Движение.Сумма       = мСумма;
		
		// БИТ_ЖКХ 29.05.2014{{	
		Движение.Организация   = Организация;
		// БИТ_ЖКХ 29.05.2014}}
		
		//// БИТ_ЖКХ 15.03.2016 11:02:25 Начало правки...
		//ДвижениеУслПоПериоду = НачислениеПоУслПоПериоду.Добавить();
		//Если СтрокаТЧ.Сумма < 0 тогда
		//	ДвижениеУслПоПериоду.ВидДвижения = ВидДвиженияНакопления.Расход;
		//	мСумма = - СтрокаТЧ.Сумма;
		//иначе
		//	ДвижениеУслПоПериоду.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	мСумма =  СтрокаТЧ.Сумма;
		//КонецЕсли;
		//ДвижениеУслПоПериоду.Период				  = СтрокаТЧ.Период;
		//ДвижениеУслПоПериоду.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
		//ДвижениеУслПоПериоду.УслугаЖКХ			  = СтрокаТЧ.Услуга;
		//ДвижениеУслПоПериоду.Организация		  = Организация;
		//ДвижениеУслПоПериоду.ПериодВзаиморасчетов = СтрокаТЧ.Период;
		////ДвижениеУслПоПериоду.ВидНачисления		  = СтрокаТЧ.ВидНачисления;
		//ДвижениеУслПоПериоду.Сумма				  = мСумма;
		//// БИТ_ЖКХ 15.03.2016 11:02:25 Конец правки.
		
	КонецЦикла;
	
	НачислениеПоУсл.Записывать = Истина;
	
	//// БИТ_ЖКХ 15.03.2016 11:47:15 Начало правки... 
	//НачислениеПоУслПоПериоду.Записывать = Истина;
	//// БИТ_ЖКХ 15.03.2016 11:47:18 Конец правки. 
	
КонецПроцедуры

Процедура СформироватьДвиженияВводНачальныхОстатковПоКУХозрасчетный(ТаблицаУслуг,Реквизиты, Движения, Отказ) Экспорт
	
	Для каждого СтрокаТаблицы Из ТаблицаУслуг Цикл
		
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетАбонента) 
			ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.СчетКУ) Тогда
			Продолжить;
		КонецЕсли; 
		
		Проводка = Движения.Хозрасчетный.Добавить();
		
		Проводка.Период      = Реквизиты.Дата;
		Проводка.Содержание  = "Ввод начальных остатков по КУ";
		Проводка.Организация = Реквизиты.Организация;
		
		мСумма = СтрокаТаблицы.Сумма;
		
		НаправлениеДвиженияАбонента = "Дт";
		НаправлениеДвиженияКУ       = "Кт";
		
		Если мСумма < 0 Тогда
			
			мСумма = мСумма * -1;
			НаправлениеДвиженияАбонента = "Кт";
			НаправлениеДвиженияКУ       = "Дт";
			
		КонецЕсли; 
		
		Проводка["Счет" + НаправлениеДвиженияАбонента] = СтрокаТаблицы.СчетАбонента;
		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияАбонента], Проводка["Субконто" + НаправлениеДвиженияАбонента], 1, СтрокаТаблицы.Субконто1);
		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияАбонента], Проводка["Субконто" + НаправлениеДвиженияАбонента], 2, СтрокаТаблицы.Субконто2);
		БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияАбонента], Проводка["Субконто" + НаправлениеДвиженияАбонента], 3, СтрокаТаблицы.Субконто3);
		Проводка["Счет" + НаправлениеДвиженияКУ] = СтрокаТаблицы.СчетКУ;
		Проводка.Сумма = мСумма;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры

// БИТ_ЖКХ 30.09.2016 10:43:23 Начало правки...
Процедура СформироватьДвиженияВводНачальныхОстатковПоКУНачисленияПоУслугамЖКХПоПериоду(Организация, ТаблицаУслуг, Движения, Отказ) Экспорт
	
	НачислениеПоУслПоПериоду = Движения.бит_НачисленияПоУслугамЖКХПоПериоду;

	Для каждого СтрокаТЧ Из ТаблицаУслуг Цикл
		
		Движение = НачислениеПоУслПоПериоду.Добавить();
		Если СтрокаТЧ.Сумма < 0 тогда
			Движение.ВидДвижения   = ВидДвиженияНакопления.Расход;
			мСумма = - СтрокаТЧ.Сумма;
			Движение.ВидНачисления = Перечисления.бит_ВидНачисленияПоУслугамЖКХ.Аванс;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.ПериодВзаиморасчетов = КонецМесяца(СтрокаТЧ.Период);
			мСумма =  СтрокаТЧ.Сумма;
		КонецЕсли;
		Движение.Период				  = СтрокаТЧ.Период;
		Движение.ЛицевойСчет		  = СтрокаТЧ.ЛицевойСчет;
		Движение.УслугаЖКХ			  = СтрокаТЧ.Услуга;
		Движение.Организация		  = Организация;
		Движение.Сумма				  = мСумма;
		
	КонецЦикла;
	
	НачислениеПоУслПоПериоду.Записывать = Истина;
	
КонецПроцедуры
// БИТ_ЖКХ 30.09.2016 10:43:23 Конец правки.

// БИТ_ЖКХ 09.08.2016 18:07:19 Начало правки...
Процедура СформироватьДвиженияВводаНачальныхОстатковПениПоКУХозрасчетный(ТаблицаЛицевыхСчетов, Реквизиты, Движения, Отказ) Экспорт
	
	
	// БИТ_ЖКХ 13.10.2015 18:02:02 Начало правки...
	ТаблицаРасчетаНДС = Новый ТаблицаЗначений;
	Колонки = ТаблицаРасчетаНДС.Колонки;
	Колонки.Добавить("Номенклатура",	);
	Колонки.Добавить("СуммаНачислений",	ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	Колонки.Добавить("СуммаБезНДС",		ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	// БИТ_ЖКХ 13.10.2015 18:02:02 Конец правки.
	
	СтруктураНастроек = Новый Структура();
	СтруктураНастроек.Вставить("СчетАбонента", Неопределено);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Реквизиты.Дата, Реквизиты.Организация, СтруктураНастроек);
	
	Для каждого СтрокаТЧ Из ТаблицаЛицевыхСчетов Цикл
		
		Если ЗначениеЗаполнено( СтрокаТЧ.СчетАбонента) И ЗначениеЗаполнено( СтрокаТЧ.СчетКУ) Тогда 
			
			Проводка			 = Движения.Хозрасчетный.Добавить();
			мСумма				 = СтрокаТЧ.Сумма;
			Проводка.Период      = Реквизиты.Дата;
			Проводка.Содержание  = "Ввод начальных остатков пени по КУ";
			Проводка.Организация = Реквизиты.Организация;
			
			НаправлениеДвиженияАбонента = "Дт";
			НаправлениеДвиженияКУ       = "Кт";
			
			Если мСумма < 0 
				И НЕ (СтрокаТЧ.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД
				ИЛИ СтрокаТЧ.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаЕНВД
				ИЛИ СтрокаТЧ.СчетКУ = ПланыСчетов.Хозрасчетный.ПрочиеДоходы
				ИЛИ СтрокаТЧ.СчетКУ = ПланыСчетов.Хозрасчетный.ПрочиеРасходы) Тогда //Необходимость исключений, как в разовых.
				
				мСумма = мСумма * -1;
				НаправлениеДвиженияАбонента = "Кт";
				НаправлениеДвиженияКУ       = "Дт";
			КонецЕсли; 
			
			Проводка["Счет" + НаправлениеДвиженияАбонента] = СтрокаТЧ.СчетАбонента;
			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияАбонента], Проводка["Субконто" + НаправлениеДвиженияАбонента], 1, СтрокаТЧ.Субконто1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияАбонента], Проводка["Субконто" + НаправлениеДвиженияАбонента], 2, СтрокаТЧ.Субконто2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияАбонента], Проводка["Субконто" + НаправлениеДвиженияАбонента], 3, СтрокаТЧ.Субконто3);
			Проводка["Счет" + НаправлениеДвиженияКУ] = СтрокаТЧ.СчетКУ;
			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияКУ], Проводка["Субконто" + НаправлениеДвиженияКУ], 1, СтрокаТЧ.СубконтоКУ1);
			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияКУ], Проводка["Субконто" + НаправлениеДвиженияКУ], 2, СтрокаТЧ.СубконтоКУ2);
			БухгалтерскийУчет.УстановитьСубконто(Проводка["Счет" + НаправлениеДвиженияКУ], Проводка["Субконто" + НаправлениеДвиженияКУ], 3, СтрокаТЧ.СубконтоКУ3);	
			Проводка.Сумма = мСумма;
			
			Если СтрокаТЧ.СчетКУ = ПланыСчетов.Хозрасчетный.ВыручкаНеЕНВД  Тогда
				Если ЗначениеЗаполнено(Проводка.СубконтоКт.СтавкиНДС) Тогда
					НДС_Ставка= УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(Проводка.СубконтоКт.СтавкиНДС);
					Проводка.СуммаНУКт = бит_РасчетыПоКоммунальнымУслугам.CкорректированнаяCуммаНДС(ТаблицаРасчетаНДС, СтрокаТЧ.СубконтоКУ3, мСумма, НДС_Ставка);
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Хозрасчетный.Записывать = Истина;
	
КонецПроцедуры
// БИТ_ЖКХ 09.08.2016 18:07:19 Конец правки.

Процедура СформироватьДвиженияПоИсполнительным(СписокЛС,Реквизиты, Движения,Отказ) Экспорт
	
	Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ОплатаКУСписокЛС.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист КАК ИсполнительныйЛист,
		|	СУММА(ВЫБОР
		|			КОГДА бит_ОплатаКУСписокУслуг.Услуга = &УслугаГоспошлина
		|				ТОГДА бит_ОплатаКУСписокУслуг.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОплатаГоспошлина,
		|	СУММА(ВЫБОР
		|			КОГДА бит_ОплатаКУСписокУслуг.Услуга = &УслугаПредставительские
		|				ТОГДА бит_ОплатаКУСписокУслуг.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК ОплатаПредставительские,
		|	СУММА(ВЫБОР
		|			КОГДА бит_ОплатаКУСписокУслуг.Услуга = &УслугаГоспошлина
		|					ИЛИ бит_ОплатаКУСписокУслуг.Услуга = &УслугаПредставительские
		|				ТОГДА 0
		|			ИНАЧЕ бит_ОплатаКУСписокУслуг.Сумма
		|		КОНЕЦ) КАК ОплатаУслуга,
		|	бит_ОплатаКУСписокЛС.Ссылка.Дата КАК ДатаОплаты
		|ПОМЕСТИТЬ втОплаты
		|ИЗ
		|	Документ.бит_ОплатаКУ.СписокЛС КАК бит_ОплатаКУСписокЛС
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.бит_ОплатаКУ.СписокУслуг КАК бит_ОплатаКУСписокУслуг
		|		ПО бит_ОплатаКУСписокЛС.Ссылка = бит_ОплатаКУСписокУслуг.Ссылка
		|			И бит_ОплатаКУСписокЛС.ЛицевойСчет = бит_ОплатаКУСписокУслуг.ЛицевойСчет
		|			И бит_ОплатаКУСписокЛС.лб_КлючСтроки = бит_ОплатаКУСписокУслуг.лб_КлючСтроки
		|ГДЕ
		|	бит_ОплатаКУСписокЛС.Ссылка = &Ссылка
		|	И бит_ОплатаКУСписокЛС.ИсполнительныйЛист <> ЗНАЧЕНИЕ(документ.бит_ИсполнительныйЛист.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_ОплатаКУСписокЛС.ЛицевойСчет,
		|	бит_ОплатаКУСписокЛС.ИсполнительныйЛист,
		|	бит_ОплатаКУСписокЛС.Ссылка.Дата
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.Регистратор КАК Регистратор,
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ФИОДолжника КАК ФИОДолжника,
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.Услуга КАК Услуга,
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.ИсполнительныйЛист КАК ИсполнительныйЛист,
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.СуммаПриход КАК СуммаПриход,
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.СуммаГоспошлиныПриход КАК СуммаГоспошлиныПриход,
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.СуммаПредставительскихРасходовПриход КАК СуммаПредставительскихРасходовПриход
		|ПОМЕСТИТЬ ВТНачисления
		|ИЗ
		|	РегистрНакопления.ВзаиморасчетыПоИсполнительномуПроизводству.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			ИсполнительныйЛист В
		|				(ВЫБРАТЬ
		|					ВТОплаты.ИсполнительныйЛист
		|				ИЗ
		|					ВТОплаты КАК ВТОплаты)) КАК ВзаиморасчетыПоИсполнительномуПроизводствуОбороты
		|ГДЕ
		|	ВзаиморасчетыПоИсполнительномуПроизводствуОбороты.Регистратор В
		|			(ВЫБРАТЬ
		|				ВТОплаты.ИсполнительныйЛист
		|			ИЗ
		|				ВТОплаты КАК ВТОплаты)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТНачисления.Регистратор КАК Регистратор,
		|	ВТНачисления.ЛицевойСчет КАК ЛицевойСчет,
		|	ВТНачисления.ФИОДолжника КАК ФИОДолжника,
		|	ВТНачисления.Услуга КАК Услуга,
		|	ВТНачисления.ИсполнительныйЛист КАК ИсполнительныйЛист,
		|	втОплаты.ОплатаУслуга КАК Сумма,
		|	втОплаты.ОплатаГоспошлина КАК СуммаГоспошлины,
		|	втОплаты.ОплатаПредставительские КАК СуммаПредставительскихРасходов,
		|	втОплаты.ДатаОплаты КАК ДатаОплаты,
		|	втОплаты.ДатаОплаты КАК Период
		|ИЗ
		|	ВТНачисления КАК ВТНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ втОплаты КАК втОплаты
		|		ПО ВТНачисления.ИсполнительныйЛист = втОплаты.ИсполнительныйЛист";
		
		Запрос.УстановитьПараметр("Ссылка", Реквизиты.Ссылка);
		Запрос.УстановитьПараметр("УслугаГоспошлина", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000012"));
		Запрос.УстановитьПараметр("УслугаПредставительские", Справочники.бит_УслугиЖКХ.НайтиПоКоду("00-000013"));
		
		РезультатЗапроса = Запрос.Выполнить();
		Если не РезультатЗапроса.Пустой() тогда                 
			ДвиженияИполнительные = Движения.ВзаиморасчетыПоИсполнительномуПроизводству;
			ДвиженияИполнительные.Записывать = истина;
			ДвиженияИполнительные.Записать();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
				Движение =ДвиженияИполнительные.ДобавитьРасход(); 
				ЗаполнитьЗначенияСвойств(Движение,ВыборкаДетальныеЗаписи);
			КонецЦикла;
		КонецЕсли;
		
		//МассивДокументов = Новый Массив;
		
		Для Каждого Стр Из СписокЛС Цикл
			Если Стр.ИзменитьСтатусИЛ Тогда
				Исполнительный = Стр.ИсполнительныйЛист.ПолучитьОбъект();
				Исполнительный.Статус = Перечисления.СтатусыПоИсполнительнымЛистам.ИсполненВПолномОбъеме;
				Исполнительный.Записать(РежимЗаписиДокумента.Проведение);
				//МассивДокументов.Добавить(Стр.ИсполнительныйЛист);
			КонецЕсли;
		КонецЦикла;	
КонецПроцедуры
#КонецОбласти
